#1) მომხმარებელს input-ის გამოყენებით შემოატანინეთ სახელი, და მომხმარებელი როცა შემოიყვანს თავის სახელს უნდა გამოიტანოს hello მომხმარებელის_სახელ
name = input("Enter yout name:")
print("hello " +  name)


#2) მომხმარებელს input-ის გამოყენებით შემოატანინეთ სახელი, გვარი, ასაკი და ქალაქი. როცა  შემოიტანს
#მომხმარებელი ყველაფერს მერე უნდა დაუპრინტოთ გრძელი წინადადება

name = input("თქვენ ხართ სახელი:")
lastname = input("თქვენი გვარია: ")

print("hello " +  name + " " + " " + lastname)

age = input("თქვენი ასაკი:")
place = input("საცხოვრებელი გარემო:")
print("გამარჯობა" + name + lastname + "," + age + " წლის " + "," + place + ".")

#3) კომენტარებით ახსენით რა არის input-ი და output-ი, რამდენიმე მაგალითიც გააკეთეთ input-ებზე

#input - ითარგმნება როგორც "შეტანა" ან "შეყვანა". როდესაც მომხმარებელს შეაქვს ინფორმაცია კომპიუტერში.
#output - ითარგმენბა როგორც "გამოტანა" ან "გამოყვანა". როდესაც კომპიუტერში მყოფი ინფორმაცია გამოდის ეკრანზე.

