#1)   შექმენით ცვლადი სადაც მიანიჭებთ თქვენს სახელს ეს ცვლადი უნდა დააკომენტაროთ და დაპრინტოთ და ახსნათ კომენტარებით რატომ ვერ გამოიტანს ცვლადის მნიშვნელობას

# name = "aleqsandre"

print(name)

# Printi მნიშვნელობას ვერ გამოიტანს რადგან, ცვლადი "name" არ არის დაკომენტარებული. პროგრამას არ შეუძლია კომენტარის წაკითხვა. 


#2)  ახსენით კომენტარებით რა არის case-sensitive language და გააკეთეთ რამოდენიმე მაგალითიც
# case-sensitive laguage არის ენა რომელსაც იყენებენ პროგრამირების ენების ასაღწერად რადგან განანსხვავონ დიდი და პატარა ასოები. პროგრამირებაში დიდ და პატარა ასოებს სხვადასხვა მნიშვნელობა აქვს.

print("name")
print("Name")

print("car")
print("Car")


#3) შექმენით ცვლადი რომელიც იქნება credit და უნდა შექმნათ კიდე 2 ცვლადი რომელიც იქნება credit დიდი ასოებით და ახსენით კომენტარებით რა განსხვავებაა ამ ცვლადების შორის
#?



#6) შექმენით 2 ცვლადი რომელიც ექნება ერთნაირი სახელები და სხვადახსხვანაირი მნიშვნელობები და და უნდა დაპრინტოთ და ასევე ახსენით კომენტარებით რატომ გამოიტანს პირველ ცვლადს და არა მეორე ცვლადს


variable_name = "First variable"
variable_name = "Second variable"

print(variable_name)

#როდესაც ჩვენ ვბეჭდავთ variable_name-ს, გამოვა "second varaible". ეს იმიტომ ხდება, რომ Python-ში ცვლადის მინიჭებები თანმიმდევრულია და ბოლო დავალება (variable_name = "second variable") განსაზღვრავს ცვლადის მიმდინარე მნიშვნელობას დაბეჭვდის დროს.


#7) სიტყვები:
#Declare - რაღაცის შექმნა/დეკლარაცია
#Case-sensitive - ქეის სენსიტიური
#Ignore - იგნორირება
#Comment - კომენტარი





