#1) მომხმარებელს input-ის გამოყენებით უნდა შემოატანინოთ მონაცემთა ტიპი და შემდეგ უნდა დაპრინტოთ მომხმარებლის შეტანილი მონაცემთა ტიპი example: თუ მომხმარებელმა შემოიტანა string-ი მაშინ უნდა გამოიტანოს <class string>

input ( "your number: ")
print (type("your number"))

#2) შექმენით ცვლადი სადაც შეიტანთ string-ს და უნდა დაპრინტოთ ცვლადის მონაცემთა ტიპი

guitar = "Fender"
print (type (guitar))

#3) შექმენით ცვლადი სადაც შეიტანთ string-ს და ეს სტრინგი უნდა გადააქციოთ ინტეჯერად და უნდა ახსნათ კომენტარებით რატო არ შეიძლება რომ ეს string-ი გადავაქციოთ ინტეჯერად

#4ახსენით type ფუნქცია რას აკეთებს კომენტარებით და გააკეთეთ მაგალითებიც

#Python-ში type() ფუნქცია გამოიყენება პითონის ობიექტის ტიპის დასადგენად.


# მაგალითი N1
x = 5
print(type(x)) 

# მაგალითი N2
y = 10.3
print(type(y))

# მაგალითი N3
W = "Hello, World!"
print(type(W))

# მაგალითი N4
my_list = [1, 2, 3, 4, 5]
print(type(my_list))

#5) გატესტეთ ეს კოდი ახსენით და კომენტარებით რას აკეთებს 
#num1 = "10"
#num2 = "10"
#print(int(num1) + int(num2))

num1 = "10"
num2 = "10"
print(int(num1) + int(num2))

# ამ კოდში num1 ვუმატებთ num2-ს. ეს რომ მოხდეს num1 და num2 გადავაქციოთ integer- ად რომ მოხდეს მათი შეკრება.


#6) ახსენით კომენტარებით რას ნიშნავს string, integer, float და გააკეთეთ რამოდენიმე მაგალითიც

# string- არის "" ში ჩაწერილი ტექსტის ან ინფორმაციის ტიპი,integer- არის რიცხვის სახით ჩაწერილი ინფორმაცია 1,2,3,4,5,... .froat- არის ათწილადის სახით ჩაწერილი ინფორმაცია.

string = "hello!"
integer = 500
float = 3.22

