#1) გააკეთეთ 3 ცალი სწორი კოდი და 3 ცალი არასწორი კოდი და უნდა ახსნათ რატომ არის ეს კოდი სწორი და რატომ არის ეს კოდი არასწორი

# correct 1
num1 = 10
num2 = 20
result = num1 + num2
print(result)
#განმარტება: ეს კოდი სწორად ანიჭებს მნიშვნელობებს num1 და num2, ითვლის მათ ჯამს და ბეჭდავს შედეგს (30). ის აჩვენებს ძირითად არითმეტიკულ და ცვლადის დავალებას პითონში.

# correct 2
num1 = 10
num2 = 20
num3 = 15

max_num = max(num1, num2, num3)
print("Maximum number:", max_num)

#ეს კოდი პოულობს მაქსიმალურ რიცხვ ამ სამ რიცხვს შორის (num1, num2, num3) და პითონის ჩაშენებული max() ფუნქციის გამოყენებით.

#correct 3

fruits = ["apple", "banana", "cherry"]
print(fruits)

#ეს კოდი ქმნის ხილის სიას, რომელიც შეიცავს სამ ელემენტს.

#incorrect 1

num1 = 10
num2 = 20
result = num1 + num2
print(rest)

#ეს კოდი არასწორია და დაშვებულია ძალიან მარტივი, მაგრამ ხშირი შეცცდომა. არასწორად არი დაწერილი სიტყვა "result"

#




#2) ახსენით debugger-ი რაარის კომენტარებით და გააკეთეთ ასევე მაგალითებიც

#Debugger არის ინსტრუმენტი, რომელიც გამოიყენება პროგრამული უზრუნველყოფის შემუშავებაში, რათა დაეხმაროს პროგრამისტებს იპოვონ და გამოასწორონ შეცდომები (შეცდომები) თავიანთ კოდში.

#3) შექმენით ცვლადი რომელიც იქნება name და მინიჭებული იქნება თქვენი სახელი და უნდა დაპრინტოთ ეს ცვლადი სწორი გზით და არასწორი გზით და უნდა ახსნათ კომენტარებით რატომ არის ეს გზა სწორი და რატომ არ არის ეს გზა სწორი.
#სწორი გზა
name = "ალექსანდრე"
print(name)
#ეს გზა სწორია რადგან კოდში არ არის დაშვებული შეცდომა.

#არასწორი გზა
name = "ალექსანდრე"
print(age)
#ამ კოდში არ არი დაშვებული შეცდომა მაგრამ ფუნქცია print-ის დროს არაფერი გამოვა ტერმინალში რადგან age-ის მნიშვმელობა არ ვიცით.


#4) დაპრინტეთ GOA is the best academy in georgia სწორი გზით და არასწორი გზით და ახსენით კომენტარებით რატომ არის ეკ გზა სწორი და რატომ არ არის მეორე გზა სწორი

# correct way

print("GOA is the best academy in Georgia")

#სტრიქონის პირდაპირ განთავსება print()-ში უზრუნველყოფს, რომ ზუსტი შეტყობინება გამოჩნდება ისე, როგორც ეს იყო განკუთვნილი.

# incorret way
print("GOA")
print("is")
print("the")
print("best")
print("academy")
print("in")
print("Georgia")

#ეს მიდგომა ბეჭდავს თითოეულ სიტყვას ახალ სტრიქონზე, რომელიც არღვევს წინადადების განზრახ სტრუქტურას, როგორც ერთიან შეკრულ შეტყობინებას. ის არ აერთიანებს სიტყვებს ერთ წინადადებაში.







