#1) მომხმარებელს შემოატანინოთ რიცხვი, შემდეგ კი დაბეჭდეთ ეს რიცხვი კენტია თუ ლუწი

# შევაყვანინოთ მომხმარებელს სასურველი რიცხვი
#number = int(input("შეიყვანე რიცხვი: "))

# გავიგოთ არის თუ არა რიცხვი კენტი ან ლუწი
#if number % 2 == 0:
    #print("რიცხცი ლუწია.")
#else:
   # print("რიცხვი კენტია.")

#2)მომხმარებელს შემომატანინეთ რიცხვი და შემდეგ დაბეჭდეთ მომხმარებლის შემოტანილი რიცხვი არის თუ არა ხუთის ჯერადი

# Ask the user to input a number

input_value = input("შეიყვანეთ რიცხვი: ")
   # ვნახოთ არის თუ არა რიცხვი 5- ის ჯერადი
if number % 5 == 0:
    print("რიცხვი არის ხუთის ჯერადი.")
else:
    print(" რიცხვი არ არის ხუთის ჯერადი.")


