#1) 1-დან 100-მდე დაითვალეთ ხუთის ჯერადი რიცხვების ჯამი

sum = 0

for number in range(1, 101, 5):
     sum += number
print(sum)

#2) 1 დან 100 მდე დაბეჭდეთ ყოველი ლუწი რიცხვი და მიუწერეთ მათ რომ ლუწია, შემდეგ 1 და 100 მდე დაბეჭდეთ ყოველი კენტი რიცხვი და მიუწერეთ რომ კენტია, გამოიყენეთ მხოლოდ ლუპი


for i in range(0, 101, 2):
    print(str(i) + " " + "even")

for i in range(1, 101, 2):
    print(str(i) + " " + "odd") 
        
#3) 1-დან 100-მდე დაითვალეთ ხუთის ჯერადი რიცხვების ჯამი გამოიყენეთ if, else გამოგადგებათ % ნიშანი

for i in range(1, 101):
    if i % 5 += 0: